app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations"
---
  def index
    #TODO: do you know why this uses, ids instead of id, and user instead of users
    @destinations = Destination.select do |destination|

SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @destination = Destination.find params[:id]

SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def edit
    @destination = Destination.find params[:id]

SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "destinations" WHERE "destinations"."id" = $1  [["id", 13]]
---
  def destroy
    #TODO: update the total travel time due to this.
    Destination.find(params[:id]).destroy