app/controllers/rentals_controller.rb

  def index
    @rentals = Rental.all
---
SELECT "rentals".* FROM "rentals"

  def show
    @rental = Rental.find params[:id]
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def edit
    @rental = Rental.find params[:id]
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]

  def update
    rental = Rental.find(params[:id])
    rental.update! rental_params
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "rentals" SET "street_address" = $1, "suburb" = $2, "price" = $3, "image" = $4, "updated_at" = $5 WHERE "rentals"."id" = $6  [["street_address", "8 Carrington Street"], ["suburb", "Strathfield"], ["price", 690.0], ["image", "https://i.imgur.com/XXENw5K.jpg?1"], ["updated_at", "2022-01-30 05:19:46.109311"], ["id", 23]]

  def destroy
    Rental.find(params[:id]).destroy
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "rentals" WHERE "rentals"."id" = $1  [["id", 16]]